examples/PilotDC-1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    location "system";
    object   blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;
vertices
(
    (-0.21 -0.21 -1e-05)
    (0.21 -0.21 -1e-05)
    (0.21 0.21 -1e-05)
    (-0.21 0.21 -1e-05)
    (-0.21 -0.21 0.31)
    (0.21 -0.21 0.31)
    (0.21 0.21 0.31)
    (-0.21 0.21 0.31)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 45) simpleGrading (1 1 1)
);
boundary
(
    wallraw
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
            (0 4 7 3)
            (3 2 1 0)
            (4 5 6 7)
            (1 2 6 5)
        );
    }
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
